masSymbols = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И',
              'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 
              'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ы', 
              'Ь', 'Э', 'Ю', 'Я', '1', '2', '3', '4', '5', 
              '6', '7', '8', '9', '0']
masMorze = ["*-", "-***", "*--", "--*", 
            "-**", "*", "***-", "--**",
            "**", "*---", "-*-", "*-**",
            "--", "-*", "---", "*--*", 
            "*-*", "***", "-", "**-", 
            "**-*", "****", "-*-*",
            "---*", "----", "--*-",
            "-*--", "-**-", "**-**",
            "**--", "*-*-", "*----",
            "**---", "***--", "****-",
            "*****", "-****", "--***",
            "---**", "----*", "-----"]

text = "Я делаю практику"
text = text.upper()
outputText = str()
for val in text:
    if val != ' ':
        outputText = outputText+masMorze[masSymbols.index(val,0)]
        #print(masSymbols.index(val,0))
    else:
        outputText = outputText + "    "
print(outputText)